#include <iostream>  // Підключення бібліотеки для введення/виведення
#include "FuncA.h"   // Підключення заголовного файлу FuncA.h, який містить опис класу FuncA

int main() {
    double x;       // Змінна для зберігання введеного значення x
    int terms;     // Змінна для зберігання кількості членів ряду

    // Запит на введення значення x
    std::cout << "Введіть значення x: ";
    std::cin >> x; // Зчитування значення x з консолі

    // Запит на введення кількості членів ряду
    std::cout << "Введіть кількість членів ряду для обчислення: ";
    std::cin >> terms; // Зчитування кількості членів з консолі

    FuncA func; // Створюємо об'єкт класу FuncA
    double result = func.Calculate(x, terms); // Викликаємо метод Calculate через об'єкт func

    // Виводимо результат обчислення
    std::cout << "Сума ряду: " << result << std::endl;

    return 0; // Завершення програми
}

